#!/usr/bin/env python
# coding: utf-8

# 
# # 作业四：撰写项目README并完成开源
# 
# ## 评分标准
# 1.格式规范（有至少3个小标题，内容完整），一个小标题5分，最高20分
# 
# 2.图文并茂，一张图5分，最高20分
# 
# 3.有可运行的代码，且代码内有详细注释，20分
# 
# 4.代码开源到github，15分
# 
# 5.代码同步到gitee，5分
# 
# ## 作业目的
# 使用MarkDown撰写项目并且学会使用开源工具。
# 
# 
# 
# ## 参考资料：
# - [如何写好一篇高质量的精选项目？](https://aistudio.baidu.com/aistudio/projectdetail/2175889)

# # 作业内容
# 把自己的项目描述放在对应区域中，形成一个完整流程项目，并且在最后声明自己项目的github和gitee链接
# 
# 
# 
# 
# 
# 
# 
# 

# ## 一、项目背景介绍
# 该部分主要向大家介绍你的项目目前社会研究情况，研究热度，或者用简短精炼的语言让大家理解为什么要做出这个项目

# ## 二、数据介绍
# 该部分主要想大家介绍你的数据集基本情况，比如数据集的名字、来源,或者是图像的数量，类别，最后在把随机一张图像通过代码展示

# ## 三、模型介绍
# 想写好一个好的精品项目，项目的内容必须包含理论内容和实践相互结合，该部分主要是理论部分，向大家介绍一下你的模型原理等内容。

# ## 四、模型训练
# 该部分主要是实践部分，也是相对来说话费时间最长的一部分，该部分主要展示模型训练的内容，同时向大家讲解模型参数的设置

# ## 五、模型评估
# 该部分主要是对训练好的模型进行评估，可以是用验证集进行评估，或者是直接预测结果。评估结果和预测结果尽量展示出来，增加吸引力。

# ## 六、总结与升华
# 接近到项目的尾声时，需要进行主题的升华，也就是说明本项目的亮点，以及不足之处，后续应该如何改进等

# ## 七、个人总结
# 该部分也是项目最后一阶段，需要作者介绍自己，以及作者的兴趣方向等，最后在下面附上作者的个人主页链接

# ## 提交链接
# aistudio链接：[基于PaddleX2.0实现大白菜病害分类检测](https://aistudio.baidu.com/aistudio/projectdetail/3521181)
# 
# github链接：
# 
# gitee链接：
